
{
    "title" : "British Standards Institute",
    "subtitle" : "The Standards Development platform for the British Standards Institute",
    "skills" : 
    	{
            "angular" : {
                "imgName" : "angularjs",
                "humanName" : "AngularJS",
                "description" : "AngularJS was used for the heavily interactive 'draft view' area of the site. Users can select which section of a draft to read, comment on it and view other user's comments."
            },
            "requirejs": {
                "humanName" : "RequireJS",
                "description" : "RequiredJS was used to load relevant scripts and their dependencies throughout the site."
            },
            "gulp" : {
                "imgName" : "gulp",
                "humanName" : "Gulp",
                "description" : "Gulp was used as a build tool. It was used to minify files, compile Handlebars templates and for many other automated jobs."
            },
            "handlebars" :{
                "humanName" : "Handlebars",
                "description" : "Handlebars was used as a templating engine to create HTML files. This meant sections such as the header and footer could be defined once and reused on every page."
            },
            "nodejs" : {
                "imgName" : "node",
                "humanName" : "NodeJS",
                "description" : "NodeJS was used to create a server and simulate JSON responses from endpoints."
            },
            "protractor" : {
                "humanName" : "Protractor",
                "description" : "Protractor was used to create unit tests for the Angular functionality."
            },
            "phantomjs" : {
                "imgName" : "phantomjs",
                "humanName" : "Phantomjs",
                "description" : "PhantomJS was combined with other JavaScript libraries to create CSS regression tests for the website. The technique involved taking screenshots of webpage templates and comparing these as development continued to ensure nothing had changed accidently."
            }
    	}
    
}